sandbox/servicemix-soap2/src/test/java/org/apache/servicemix/soap/HelloWorld-DOC-Input.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">

  <SOAP-ENV:Header>
    <HelloHeader xmlns="uri:HelloWorld" SOAP-ENV:mustUnderstand="1">
      <id>1234567890</id>
    </HelloHeader>
  </SOAP-ENV:Header>
  
  <SOAP-ENV:Body>
    <HelloRequest xmlns="uri:HelloWorld">
      <text>hello</text>
    </HelloRequest>
  </SOAP-ENV:Body>
  
</SOAP-ENV:Envelope>
